node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Placeholder_2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "random_normal/mul"
  op: "Mul"
  input: "random_normal/RandomStandardNormal"
  input: "random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "random_normal"
  op: "Add"
  input: "random_normal/mul"
  input: "random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Variable"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
        dim {
          size: 2
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Variable/Assign"
  op: "Assign"
  input: "Variable"
  input: "random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Variable/read"
  op: "Identity"
  input: "Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
}
node {
  name: "random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "random_normal_1/mul"
  op: "Mul"
  input: "random_normal_1/RandomStandardNormal"
  input: "random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "random_normal_1"
  op: "Add"
  input: "random_normal_1/mul"
  input: "random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Variable_1"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Variable_1/Assign"
  op: "Assign"
  input: "Variable_1"
  input: "random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable_1"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Variable_1/read"
  op: "Identity"
  input: "Variable_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable_1"
      }
    }
  }
}
node {
  name: "transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transpose"
  op: "Transpose"
  input: "Placeholder"
  input: "transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\001\000\000\000"
      }
    }
  }
}
node {
  name: "Reshape"
  op: "Reshape"
  input: "transpose"
  input: "Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "split"
  op: "Split"
  input: "split/split_dim"
  input: "Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 20
    }
  }
}
node {
  name: "RNN/Shape"
  op: "Shape"
  input: "split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/strided_slice/pack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/strided_slice/pack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice/pack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice"
  op: "StridedSlice"
  input: "RNN/Shape"
  input: "RNN/strided_slice/pack"
  input: "RNN/strided_slice/pack_1"
  input: "RNN/strided_slice/pack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "RNN/pack/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 64
      }
    }
  }
}
node {
  name: "RNN/pack"
  op: "Pack"
  input: "RNN/strided_slice"
  input: "RNN/pack/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "RNN/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/zeros"
  op: "Fill"
  input: "RNN/pack"
  input: "RNN/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/pack_1/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 64
      }
    }
  }
}
node {
  name: "RNN/pack_1"
  op: "Pack"
  input: "RNN/strided_slice"
  input: "RNN/pack_1/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "RNN/zeros_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/zeros_1"
  op: "Fill"
  input: "RNN/pack_1"
  input: "RNN/zeros_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/pack_2/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 64
      }
    }
  }
}
node {
  name: "RNN/pack_2"
  op: "Pack"
  input: "RNN/strided_slice"
  input: "RNN/pack_2/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "RNN/zeros_2/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/zeros_2"
  op: "Fill"
  input: "RNN/pack_2"
  input: "RNN/zeros_2/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/Min"
  op: "Min"
  input: "Placeholder_2"
  input: "RNN/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/Max"
  op: "Max"
  input: "Placeholder_2"
  input: "RNN/Const_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/LessEqual/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/LessEqual"
  op: "LessEqual"
  input: "RNN/Max"
  input: "RNN/LessEqual/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/cond/Switch"
  op: "Switch"
  input: "RNN/LessEqual"
  input: "RNN/LessEqual"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond/switch_t"
  op: "Identity"
  input: "RNN/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond/switch_f"
  op: "Identity"
  input: "RNN/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond/pred_id"
  op: "Identity"
  input: "RNN/LessEqual"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond/Switch_1"
  op: "Switch"
  input: "RNN/zeros_2"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros_2"
      }
    }
  }
}
node {
  name: "RNN/cond/Switch_2"
  op: "Switch"
  input: "RNN/zeros"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros"
      }
    }
  }
}
node {
  name: "RNN/cond/Switch_3"
  op: "Switch"
  input: "RNN/zeros_1"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros_1"
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 65
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "A\000\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.214834466577
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.214834466577
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/sub"
  op: "Sub"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/max"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/mul"
  op: "Mul"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform"
  op: "Add"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/mul"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Assign"
  op: "Assign"
  input: "RNN/BasicLSTMCell/Linear/Matrix"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/read"
  op: "Identity"
  input: "RNN/BasicLSTMCell/Linear/Matrix"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Linear/concat/concat_dim"
  op: "Const"
  input: "^RNN/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Linear/concat/Switch"
  op: "Switch"
  input: "split"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@split"
      }
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Linear/concat/Switch_1"
  op: "Switch"
  input: "RNN/zeros_1"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros_1"
      }
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Linear/concat"
  op: "Concat"
  input: "RNN/cond/BasicLSTMCell/Linear/concat/concat_dim"
  input: "RNN/cond/BasicLSTMCell/Linear/concat/Switch"
  input: "RNN/cond/BasicLSTMCell/Linear/concat/Switch_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Linear/MatMul/Switch"
  op: "Switch"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix/read"
      }
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Linear/MatMul"
  op: "MatMul"
  input: "RNN/cond/BasicLSTMCell/Linear/concat"
  input: "RNN/cond/BasicLSTMCell/Linear/MatMul/Switch"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Bias/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Bias/Assign"
  op: "Assign"
  input: "RNN/BasicLSTMCell/Linear/Bias"
  input: "RNN/BasicLSTMCell/Linear/Bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Bias/read"
  op: "Identity"
  input: "RNN/BasicLSTMCell/Linear/Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/add/Switch"
  op: "Switch"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Bias/read"
      }
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/add"
  op: "Add"
  input: "RNN/cond/BasicLSTMCell/Linear/MatMul"
  input: "RNN/cond/BasicLSTMCell/add/Switch"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/split/split_dim"
  op: "Const"
  input: "^RNN/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/split"
  op: "Split"
  input: "RNN/cond/BasicLSTMCell/split/split_dim"
  input: "RNN/cond/BasicLSTMCell/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/add_1/y"
  op: "Const"
  input: "^RNN/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/add_1"
  op: "Add"
  input: "RNN/cond/BasicLSTMCell/split:2"
  input: "RNN/cond/BasicLSTMCell/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Sigmoid"
  op: "Sigmoid"
  input: "RNN/cond/BasicLSTMCell/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/mul/Switch"
  op: "Switch"
  input: "RNN/zeros"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros"
      }
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/mul"
  op: "Mul"
  input: "RNN/cond/BasicLSTMCell/mul/Switch"
  input: "RNN/cond/BasicLSTMCell/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/cond/BasicLSTMCell/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Tanh"
  op: "Tanh"
  input: "RNN/cond/BasicLSTMCell/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/mul_1"
  op: "Mul"
  input: "RNN/cond/BasicLSTMCell/Sigmoid_1"
  input: "RNN/cond/BasicLSTMCell/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/add_2"
  op: "Add"
  input: "RNN/cond/BasicLSTMCell/mul"
  input: "RNN/cond/BasicLSTMCell/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Tanh_1"
  op: "Tanh"
  input: "RNN/cond/BasicLSTMCell/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/Sigmoid_2"
  op: "Sigmoid"
  input: "RNN/cond/BasicLSTMCell/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/BasicLSTMCell/mul_2"
  op: "Mul"
  input: "RNN/cond/BasicLSTMCell/Tanh_1"
  input: "RNN/cond/BasicLSTMCell/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/Greater/y"
  op: "Const"
  input: "^RNN/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/cond/Greater/Switch"
  op: "Switch"
  input: "RNN/Min"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/Min"
      }
    }
  }
}
node {
  name: "RNN/cond/Greater"
  op: "Greater"
  input: "RNN/cond/Greater/Switch"
  input: "RNN/cond/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/cond/cond/Switch"
  op: "Switch"
  input: "RNN/cond/Greater"
  input: "RNN/cond/Greater"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond/cond/switch_t"
  op: "Identity"
  input: "RNN/cond/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond/cond/switch_f"
  op: "Identity"
  input: "RNN/cond/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond/cond/pred_id"
  op: "Identity"
  input: "RNN/cond/Greater"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond/cond/Switch_1"
  op: "Switch"
  input: "RNN/cond/BasicLSTMCell/mul_2"
  input: "RNN/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond/BasicLSTMCell/mul_2"
      }
    }
  }
}
node {
  name: "RNN/cond/cond/Switch_2"
  op: "Switch"
  input: "RNN/cond/BasicLSTMCell/add_2"
  input: "RNN/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond/BasicLSTMCell/add_2"
      }
    }
  }
}
node {
  name: "RNN/cond/cond/LessEqual/y"
  op: "Const"
  input: "^RNN/cond/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/cond/cond/LessEqual/Switch"
  op: "Switch"
  input: "Placeholder_2"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Placeholder_2"
      }
    }
  }
}
node {
  name: "RNN/cond/cond/LessEqual/Switch_1"
  op: "Switch"
  input: "RNN/cond/cond/LessEqual/Switch"
  input: "RNN/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Placeholder_2"
      }
    }
  }
}
node {
  name: "RNN/cond/cond/LessEqual"
  op: "LessEqual"
  input: "RNN/cond/cond/LessEqual/Switch_1"
  input: "RNN/cond/cond/LessEqual/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/cond/cond/Select/Switch"
  op: "Switch"
  input: "RNN/zeros_2"
  input: "RNN/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros_2"
      }
    }
  }
}
node {
  name: "RNN/cond/cond/Select/Switch_1"
  op: "Switch"
  input: "RNN/cond/cond/Select/Switch"
  input: "RNN/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros_2"
      }
    }
  }
}
node {
  name: "RNN/cond/cond/Select/Switch_2"
  op: "Switch"
  input: "RNN/cond/BasicLSTMCell/mul_2"
  input: "RNN/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond/BasicLSTMCell/mul_2"
      }
    }
  }
}
node {
  name: "RNN/cond/cond/Select"
  op: "Select"
  input: "RNN/cond/cond/LessEqual"
  input: "RNN/cond/cond/Select/Switch_1"
  input: "RNN/cond/cond/Select/Switch_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/cond/LessEqual_1/y"
  op: "Const"
  input: "^RNN/cond/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/cond/cond/LessEqual_1"
  op: "LessEqual"
  input: "RNN/cond/cond/LessEqual/Switch_1"
  input: "RNN/cond/cond/LessEqual_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/cond/cond/Select_1/Switch"
  op: "Switch"
  input: "RNN/cond/BasicLSTMCell/mul/Switch"
  input: "RNN/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros"
      }
    }
  }
}
node {
  name: "RNN/cond/cond/Select_1/Switch_1"
  op: "Switch"
  input: "RNN/cond/BasicLSTMCell/add_2"
  input: "RNN/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond/BasicLSTMCell/add_2"
      }
    }
  }
}
node {
  name: "RNN/cond/cond/Select_1"
  op: "Select"
  input: "RNN/cond/cond/LessEqual_1"
  input: "RNN/cond/cond/Select_1/Switch"
  input: "RNN/cond/cond/Select_1/Switch_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/cond/LessEqual_2/y"
  op: "Const"
  input: "^RNN/cond/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/cond/cond/LessEqual_2"
  op: "LessEqual"
  input: "RNN/cond/cond/LessEqual/Switch_1"
  input: "RNN/cond/cond/LessEqual_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/cond/cond/Select_2/Switch"
  op: "Switch"
  input: "RNN/cond/BasicLSTMCell/Linear/concat/Switch_1"
  input: "RNN/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros_1"
      }
    }
  }
}
node {
  name: "RNN/cond/cond/Select_2"
  op: "Select"
  input: "RNN/cond/cond/LessEqual_2"
  input: "RNN/cond/cond/Select_2/Switch"
  input: "RNN/cond/cond/Select/Switch_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/cond/Merge"
  op: "Merge"
  input: "RNN/cond/cond/Select"
  input: "RNN/cond/cond/Switch_1:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/cond/Merge_1"
  op: "Merge"
  input: "RNN/cond/cond/Select_1"
  input: "RNN/cond/cond/Switch_2:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/cond/Merge_2"
  op: "Merge"
  input: "RNN/cond/cond/Select_2"
  input: "RNN/cond/cond/Switch_1:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/Merge"
  op: "Merge"
  input: "RNN/cond/cond/Merge"
  input: "RNN/cond/Switch_1:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/Merge_1"
  op: "Merge"
  input: "RNN/cond/cond/Merge_1"
  input: "RNN/cond/Switch_2:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond/Merge_2"
  op: "Merge"
  input: "RNN/cond/cond/Merge_2"
  input: "RNN/cond/Switch_3:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/LessEqual_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/LessEqual_1"
  op: "LessEqual"
  input: "RNN/Max"
  input: "RNN/LessEqual_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/cond_1/Switch"
  op: "Switch"
  input: "RNN/LessEqual_1"
  input: "RNN/LessEqual_1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond_1/switch_t"
  op: "Identity"
  input: "RNN/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond_1/switch_f"
  op: "Identity"
  input: "RNN/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond_1/pred_id"
  op: "Identity"
  input: "RNN/LessEqual_1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond_1/Switch_1"
  op: "Switch"
  input: "RNN/zeros_2"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/Switch_2"
  op: "Switch"
  input: "RNN/cond/Merge_1"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond/Merge_1"
      }
    }
  }
}
node {
  name: "RNN/cond_1/Switch_3"
  op: "Switch"
  input: "RNN/cond/Merge_2"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond/Merge_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Linear/concat/concat_dim"
  op: "Const"
  input: "^RNN/cond_1/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Linear/concat/Switch"
  op: "Switch"
  input: "split:1"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@split"
      }
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Linear/concat/Switch_1"
  op: "Switch"
  input: "RNN/cond/Merge_2"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond/Merge_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Linear/concat"
  op: "Concat"
  input: "RNN/cond_1/BasicLSTMCell/Linear/concat/concat_dim"
  input: "RNN/cond_1/BasicLSTMCell/Linear/concat/Switch"
  input: "RNN/cond_1/BasicLSTMCell/Linear/concat/Switch_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Linear/MatMul/Switch"
  op: "Switch"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix/read"
      }
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Linear/MatMul"
  op: "MatMul"
  input: "RNN/cond_1/BasicLSTMCell/Linear/concat"
  input: "RNN/cond_1/BasicLSTMCell/Linear/MatMul/Switch"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/add/Switch"
  op: "Switch"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Bias/read"
      }
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/add"
  op: "Add"
  input: "RNN/cond_1/BasicLSTMCell/Linear/MatMul"
  input: "RNN/cond_1/BasicLSTMCell/add/Switch"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/split/split_dim"
  op: "Const"
  input: "^RNN/cond_1/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/split"
  op: "Split"
  input: "RNN/cond_1/BasicLSTMCell/split/split_dim"
  input: "RNN/cond_1/BasicLSTMCell/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/add_1/y"
  op: "Const"
  input: "^RNN/cond_1/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/add_1"
  op: "Add"
  input: "RNN/cond_1/BasicLSTMCell/split:2"
  input: "RNN/cond_1/BasicLSTMCell/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Sigmoid"
  op: "Sigmoid"
  input: "RNN/cond_1/BasicLSTMCell/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/mul/Switch"
  op: "Switch"
  input: "RNN/cond/Merge_1"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond/Merge_1"
      }
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/mul"
  op: "Mul"
  input: "RNN/cond_1/BasicLSTMCell/mul/Switch"
  input: "RNN/cond_1/BasicLSTMCell/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/cond_1/BasicLSTMCell/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Tanh"
  op: "Tanh"
  input: "RNN/cond_1/BasicLSTMCell/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/mul_1"
  op: "Mul"
  input: "RNN/cond_1/BasicLSTMCell/Sigmoid_1"
  input: "RNN/cond_1/BasicLSTMCell/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/add_2"
  op: "Add"
  input: "RNN/cond_1/BasicLSTMCell/mul"
  input: "RNN/cond_1/BasicLSTMCell/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Tanh_1"
  op: "Tanh"
  input: "RNN/cond_1/BasicLSTMCell/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/Sigmoid_2"
  op: "Sigmoid"
  input: "RNN/cond_1/BasicLSTMCell/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/BasicLSTMCell/mul_2"
  op: "Mul"
  input: "RNN/cond_1/BasicLSTMCell/Tanh_1"
  input: "RNN/cond_1/BasicLSTMCell/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/Greater/y"
  op: "Const"
  input: "^RNN/cond_1/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/cond_1/Greater/Switch"
  op: "Switch"
  input: "RNN/Min"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/Min"
      }
    }
  }
}
node {
  name: "RNN/cond_1/Greater"
  op: "Greater"
  input: "RNN/cond_1/Greater/Switch"
  input: "RNN/cond_1/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/cond_1/cond/Switch"
  op: "Switch"
  input: "RNN/cond_1/Greater"
  input: "RNN/cond_1/Greater"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond_1/cond/switch_t"
  op: "Identity"
  input: "RNN/cond_1/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond_1/cond/switch_f"
  op: "Identity"
  input: "RNN/cond_1/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond_1/cond/pred_id"
  op: "Identity"
  input: "RNN/cond_1/Greater"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "RNN/cond_1/cond/Switch_1"
  op: "Switch"
  input: "RNN/cond_1/BasicLSTMCell/mul_2"
  input: "RNN/cond_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond_1/BasicLSTMCell/mul_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/Switch_2"
  op: "Switch"
  input: "RNN/cond_1/BasicLSTMCell/add_2"
  input: "RNN/cond_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond_1/BasicLSTMCell/add_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/LessEqual/y"
  op: "Const"
  input: "^RNN/cond_1/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/LessEqual/Switch"
  op: "Switch"
  input: "Placeholder_2"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Placeholder_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/LessEqual/Switch_1"
  op: "Switch"
  input: "RNN/cond_1/cond/LessEqual/Switch"
  input: "RNN/cond_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Placeholder_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/LessEqual"
  op: "LessEqual"
  input: "RNN/cond_1/cond/LessEqual/Switch_1"
  input: "RNN/cond_1/cond/LessEqual/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/cond_1/cond/Select/Switch"
  op: "Switch"
  input: "RNN/zeros_2"
  input: "RNN/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/Select/Switch_1"
  op: "Switch"
  input: "RNN/cond_1/cond/Select/Switch"
  input: "RNN/cond_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/zeros_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/Select/Switch_2"
  op: "Switch"
  input: "RNN/cond_1/BasicLSTMCell/mul_2"
  input: "RNN/cond_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond_1/BasicLSTMCell/mul_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/Select"
  op: "Select"
  input: "RNN/cond_1/cond/LessEqual"
  input: "RNN/cond_1/cond/Select/Switch_1"
  input: "RNN/cond_1/cond/Select/Switch_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/cond/LessEqual_1/y"
  op: "Const"
  input: "^RNN/cond_1/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/LessEqual_1"
  op: "LessEqual"
  input: "RNN/cond_1/cond/LessEqual/Switch_1"
  input: "RNN/cond_1/cond/LessEqual_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/cond_1/cond/Select_1/Switch"
  op: "Switch"
  input: "RNN/cond_1/BasicLSTMCell/mul/Switch"
  input: "RNN/cond_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond/Merge_1"
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/Select_1/Switch_1"
  op: "Switch"
  input: "RNN/cond_1/BasicLSTMCell/add_2"
  input: "RNN/cond_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond_1/BasicLSTMCell/add_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/Select_1"
  op: "Select"
  input: "RNN/cond_1/cond/LessEqual_1"
  input: "RNN/cond_1/cond/Select_1/Switch"
  input: "RNN/cond_1/cond/Select_1/Switch_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/cond/LessEqual_2/y"
  op: "Const"
  input: "^RNN/cond_1/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/LessEqual_2"
  op: "LessEqual"
  input: "RNN/cond_1/cond/LessEqual/Switch_1"
  input: "RNN/cond_1/cond/LessEqual_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/cond_1/cond/Select_2/Switch"
  op: "Switch"
  input: "RNN/cond_1/BasicLSTMCell/Linear/concat/Switch_1"
  input: "RNN/cond_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/cond/Merge_2"
      }
    }
  }
}
node {
  name: "RNN/cond_1/cond/Select_2"
  op: "Select"
  input: "RNN/cond_1/cond/LessEqual_2"
  input: "RNN/cond_1/cond/Select_2/Switch"
  input: "RNN/cond_1/cond/Select/Switch_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/cond/Merge"
  op: "Merge"
  input: "RNN/cond_1/cond/Select"
  input: "RNN/cond_1/cond/Switch_1:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/cond/Merge_1"
  op: "Merge"
  input: "RNN/cond_1/cond/Select_1"
  input: "RNN/cond_1/cond/Switch_2:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/cond_1/cond/Merge_2"
  op: "Merge"
  input: "RNN/cond_1/cond/Select_2"
