node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\200\000\000\000\n\000\000\000"
      }
    }
  }
}
node {
  name: "random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "random_normal/mul"
  op: "Mul"
  input: "random_normal/RandomStandardNormal"
  input: "random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "random_normal"
  op: "Add"
  input: "random_normal/mul"
  input: "random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Variable"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Variable/Assign"
  op: "Assign"
  input: "Variable"
  input: "random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Variable/read"
  op: "Identity"
  input: "Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
}
node {
  name: "random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "random_normal_1/mul"
  op: "Mul"
  input: "random_normal_1/RandomStandardNormal"
  input: "random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "random_normal_1"
  op: "Add"
  input: "random_normal_1/mul"
  input: "random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Variable_1"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Variable_1/Assign"
  op: "Assign"
  input: "Variable_1"
  input: "random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable_1"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Variable_1/read"
  op: "Identity"
  input: "Variable_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable_1"
      }
    }
  }
}
node {
  name: "transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transpose"
  op: "Transpose"
  input: "Placeholder"
  input: "transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\034\000\000\000"
      }
    }
  }
}
node {
  name: "Reshape"
  op: "Reshape"
  input: "transpose"
  input: "Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "split"
  op: "Split"
  input: "split/split_dim"
  input: "Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 28
    }
  }
}
node {
  name: "RNN/Shape"
  op: "Shape"
  input: "split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/strided_slice/pack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/strided_slice/pack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice/pack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice"
  op: "StridedSlice"
  input: "RNN/Shape"
  input: "RNN/strided_slice/pack"
  input: "RNN/strided_slice/pack_1"
  input: "RNN/strided_slice/pack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "RNN/pack/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "RNN/pack"
  op: "Pack"
  input: "RNN/strided_slice"
  input: "RNN/pack/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "RNN/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/zeros"
  op: "Fill"
  input: "RNN/pack"
  input: "RNN/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/pack_1/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "RNN/pack_1"
  op: "Pack"
  input: "RNN/strided_slice"
  input: "RNN/pack_1/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "RNN/zeros_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/zeros_1"
  op: "Fill"
  input: "RNN/pack_1"
  input: "RNN/zeros_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 156
        }
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\234\000\000\000\000\002\000\000"
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.138675048947
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.138675048947
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/sub"
  op: "Sub"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/max"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/mul"
  op: "Mul"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform"
  op: "Add"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/mul"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/Assign"
  op: "Assign"
  input: "RNN/BasicLSTMCell/Linear/Matrix"
  input: "RNN/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Matrix/read"
  op: "Identity"
  input: "RNN/BasicLSTMCell/Linear/Matrix"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/concat"
  op: "Concat"
  input: "RNN/BasicLSTMCell/Linear/concat/concat_dim"
  input: "split"
  input: "RNN/zeros_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/MatMul"
  op: "MatMul"
  input: "RNN/BasicLSTMCell/Linear/concat"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Bias/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 512
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Bias/Assign"
  op: "Assign"
  input: "RNN/BasicLSTMCell/Linear/Bias"
  input: "RNN/BasicLSTMCell/Linear/Bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/BasicLSTMCell/Linear/Bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Linear/Bias/read"
  op: "Identity"
  input: "RNN/BasicLSTMCell/Linear/Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/add"
  op: "Add"
  input: "RNN/BasicLSTMCell/Linear/MatMul"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/split"
  op: "Split"
  input: "RNN/BasicLSTMCell/split/split_dim"
  input: "RNN/BasicLSTMCell/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/add_1"
  op: "Add"
  input: "RNN/BasicLSTMCell/split:2"
  input: "RNN/BasicLSTMCell/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Sigmoid"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/mul"
  op: "Mul"
  input: "RNN/zeros"
  input: "RNN/BasicLSTMCell/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Tanh"
  op: "Tanh"
  input: "RNN/BasicLSTMCell/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/mul_1"
  op: "Mul"
  input: "RNN/BasicLSTMCell/Sigmoid_1"
  input: "RNN/BasicLSTMCell/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/add_2"
  op: "Add"
  input: "RNN/BasicLSTMCell/mul"
  input: "RNN/BasicLSTMCell/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Tanh_1"
  op: "Tanh"
  input: "RNN/BasicLSTMCell/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/Sigmoid_2"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell/mul_2"
  op: "Mul"
  input: "RNN/BasicLSTMCell/Tanh_1"
  input: "RNN/BasicLSTMCell/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/Linear/concat"
  op: "Concat"
  input: "RNN/BasicLSTMCell_1/Linear/concat/concat_dim"
  input: "split:1"
  input: "RNN/BasicLSTMCell/mul_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/Linear/MatMul"
  op: "MatMul"
  input: "RNN/BasicLSTMCell_1/Linear/concat"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/add"
  op: "Add"
  input: "RNN/BasicLSTMCell_1/Linear/MatMul"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/split"
  op: "Split"
  input: "RNN/BasicLSTMCell_1/split/split_dim"
  input: "RNN/BasicLSTMCell_1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/add_1"
  op: "Add"
  input: "RNN/BasicLSTMCell_1/split:2"
  input: "RNN/BasicLSTMCell_1/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/Sigmoid"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_1/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/mul"
  op: "Mul"
  input: "RNN/BasicLSTMCell/add_2"
  input: "RNN/BasicLSTMCell_1/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_1/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/Tanh"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_1/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/mul_1"
  op: "Mul"
  input: "RNN/BasicLSTMCell_1/Sigmoid_1"
  input: "RNN/BasicLSTMCell_1/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/add_2"
  op: "Add"
  input: "RNN/BasicLSTMCell_1/mul"
  input: "RNN/BasicLSTMCell_1/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/Tanh_1"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_1/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/Sigmoid_2"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_1/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_1/mul_2"
  op: "Mul"
  input: "RNN/BasicLSTMCell_1/Tanh_1"
  input: "RNN/BasicLSTMCell_1/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/Linear/concat"
  op: "Concat"
  input: "RNN/BasicLSTMCell_2/Linear/concat/concat_dim"
  input: "split:2"
  input: "RNN/BasicLSTMCell_1/mul_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/Linear/MatMul"
  op: "MatMul"
  input: "RNN/BasicLSTMCell_2/Linear/concat"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/add"
  op: "Add"
  input: "RNN/BasicLSTMCell_2/Linear/MatMul"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/split"
  op: "Split"
  input: "RNN/BasicLSTMCell_2/split/split_dim"
  input: "RNN/BasicLSTMCell_2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/add_1"
  op: "Add"
  input: "RNN/BasicLSTMCell_2/split:2"
  input: "RNN/BasicLSTMCell_2/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/Sigmoid"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_2/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/mul"
  op: "Mul"
  input: "RNN/BasicLSTMCell_1/add_2"
  input: "RNN/BasicLSTMCell_2/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_2/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/Tanh"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_2/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/mul_1"
  op: "Mul"
  input: "RNN/BasicLSTMCell_2/Sigmoid_1"
  input: "RNN/BasicLSTMCell_2/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/add_2"
  op: "Add"
  input: "RNN/BasicLSTMCell_2/mul"
  input: "RNN/BasicLSTMCell_2/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/Tanh_1"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_2/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/Sigmoid_2"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_2/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_2/mul_2"
  op: "Mul"
  input: "RNN/BasicLSTMCell_2/Tanh_1"
  input: "RNN/BasicLSTMCell_2/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/Linear/concat"
  op: "Concat"
  input: "RNN/BasicLSTMCell_3/Linear/concat/concat_dim"
  input: "split:3"
  input: "RNN/BasicLSTMCell_2/mul_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/Linear/MatMul"
  op: "MatMul"
  input: "RNN/BasicLSTMCell_3/Linear/concat"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/add"
  op: "Add"
  input: "RNN/BasicLSTMCell_3/Linear/MatMul"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/split"
  op: "Split"
  input: "RNN/BasicLSTMCell_3/split/split_dim"
  input: "RNN/BasicLSTMCell_3/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/add_1"
  op: "Add"
  input: "RNN/BasicLSTMCell_3/split:2"
  input: "RNN/BasicLSTMCell_3/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/Sigmoid"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_3/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/mul"
  op: "Mul"
  input: "RNN/BasicLSTMCell_2/add_2"
  input: "RNN/BasicLSTMCell_3/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_3/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/Tanh"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_3/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/mul_1"
  op: "Mul"
  input: "RNN/BasicLSTMCell_3/Sigmoid_1"
  input: "RNN/BasicLSTMCell_3/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/add_2"
  op: "Add"
  input: "RNN/BasicLSTMCell_3/mul"
  input: "RNN/BasicLSTMCell_3/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/Tanh_1"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_3/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/Sigmoid_2"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_3/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_3/mul_2"
  op: "Mul"
  input: "RNN/BasicLSTMCell_3/Tanh_1"
  input: "RNN/BasicLSTMCell_3/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/Linear/concat"
  op: "Concat"
  input: "RNN/BasicLSTMCell_4/Linear/concat/concat_dim"
  input: "split:4"
  input: "RNN/BasicLSTMCell_3/mul_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/Linear/MatMul"
  op: "MatMul"
  input: "RNN/BasicLSTMCell_4/Linear/concat"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/add"
  op: "Add"
  input: "RNN/BasicLSTMCell_4/Linear/MatMul"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/split"
  op: "Split"
  input: "RNN/BasicLSTMCell_4/split/split_dim"
  input: "RNN/BasicLSTMCell_4/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/add_1"
  op: "Add"
  input: "RNN/BasicLSTMCell_4/split:2"
  input: "RNN/BasicLSTMCell_4/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/Sigmoid"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_4/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/mul"
  op: "Mul"
  input: "RNN/BasicLSTMCell_3/add_2"
  input: "RNN/BasicLSTMCell_4/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_4/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/Tanh"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_4/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/mul_1"
  op: "Mul"
  input: "RNN/BasicLSTMCell_4/Sigmoid_1"
  input: "RNN/BasicLSTMCell_4/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/add_2"
  op: "Add"
  input: "RNN/BasicLSTMCell_4/mul"
  input: "RNN/BasicLSTMCell_4/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/Tanh_1"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_4/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/Sigmoid_2"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_4/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_4/mul_2"
  op: "Mul"
  input: "RNN/BasicLSTMCell_4/Tanh_1"
  input: "RNN/BasicLSTMCell_4/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/Linear/concat"
  op: "Concat"
  input: "RNN/BasicLSTMCell_5/Linear/concat/concat_dim"
  input: "split:5"
  input: "RNN/BasicLSTMCell_4/mul_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/Linear/MatMul"
  op: "MatMul"
  input: "RNN/BasicLSTMCell_5/Linear/concat"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/add"
  op: "Add"
  input: "RNN/BasicLSTMCell_5/Linear/MatMul"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/split"
  op: "Split"
  input: "RNN/BasicLSTMCell_5/split/split_dim"
  input: "RNN/BasicLSTMCell_5/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/add_1"
  op: "Add"
  input: "RNN/BasicLSTMCell_5/split:2"
  input: "RNN/BasicLSTMCell_5/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/Sigmoid"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_5/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/mul"
  op: "Mul"
  input: "RNN/BasicLSTMCell_4/add_2"
  input: "RNN/BasicLSTMCell_5/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_5/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/Tanh"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_5/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/mul_1"
  op: "Mul"
  input: "RNN/BasicLSTMCell_5/Sigmoid_1"
  input: "RNN/BasicLSTMCell_5/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/add_2"
  op: "Add"
  input: "RNN/BasicLSTMCell_5/mul"
  input: "RNN/BasicLSTMCell_5/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/Tanh_1"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_5/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/Sigmoid_2"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_5/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_5/mul_2"
  op: "Mul"
  input: "RNN/BasicLSTMCell_5/Tanh_1"
  input: "RNN/BasicLSTMCell_5/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/Linear/concat"
  op: "Concat"
  input: "RNN/BasicLSTMCell_6/Linear/concat/concat_dim"
  input: "split:6"
  input: "RNN/BasicLSTMCell_5/mul_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/Linear/MatMul"
  op: "MatMul"
  input: "RNN/BasicLSTMCell_6/Linear/concat"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/add"
  op: "Add"
  input: "RNN/BasicLSTMCell_6/Linear/MatMul"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/split"
  op: "Split"
  input: "RNN/BasicLSTMCell_6/split/split_dim"
  input: "RNN/BasicLSTMCell_6/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/add_1"
  op: "Add"
  input: "RNN/BasicLSTMCell_6/split:2"
  input: "RNN/BasicLSTMCell_6/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/Sigmoid"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_6/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/mul"
  op: "Mul"
  input: "RNN/BasicLSTMCell_5/add_2"
  input: "RNN/BasicLSTMCell_6/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_6/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/Tanh"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_6/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/mul_1"
  op: "Mul"
  input: "RNN/BasicLSTMCell_6/Sigmoid_1"
  input: "RNN/BasicLSTMCell_6/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/add_2"
  op: "Add"
  input: "RNN/BasicLSTMCell_6/mul"
  input: "RNN/BasicLSTMCell_6/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/Tanh_1"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_6/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/Sigmoid_2"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_6/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_6/mul_2"
  op: "Mul"
  input: "RNN/BasicLSTMCell_6/Tanh_1"
  input: "RNN/BasicLSTMCell_6/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/Linear/concat"
  op: "Concat"
  input: "RNN/BasicLSTMCell_7/Linear/concat/concat_dim"
  input: "split:7"
  input: "RNN/BasicLSTMCell_6/mul_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/Linear/MatMul"
  op: "MatMul"
  input: "RNN/BasicLSTMCell_7/Linear/concat"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/add"
  op: "Add"
  input: "RNN/BasicLSTMCell_7/Linear/MatMul"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/split"
  op: "Split"
  input: "RNN/BasicLSTMCell_7/split/split_dim"
  input: "RNN/BasicLSTMCell_7/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/add_1"
  op: "Add"
  input: "RNN/BasicLSTMCell_7/split:2"
  input: "RNN/BasicLSTMCell_7/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/Sigmoid"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_7/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/mul"
  op: "Mul"
  input: "RNN/BasicLSTMCell_6/add_2"
  input: "RNN/BasicLSTMCell_7/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_7/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/Tanh"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_7/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/mul_1"
  op: "Mul"
  input: "RNN/BasicLSTMCell_7/Sigmoid_1"
  input: "RNN/BasicLSTMCell_7/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/add_2"
  op: "Add"
  input: "RNN/BasicLSTMCell_7/mul"
  input: "RNN/BasicLSTMCell_7/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/Tanh_1"
  op: "Tanh"
  input: "RNN/BasicLSTMCell_7/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/Sigmoid_2"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_7/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_7/mul_2"
  op: "Mul"
  input: "RNN/BasicLSTMCell_7/Tanh_1"
  input: "RNN/BasicLSTMCell_7/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/Linear/concat"
  op: "Concat"
  input: "RNN/BasicLSTMCell_8/Linear/concat/concat_dim"
  input: "split:8"
  input: "RNN/BasicLSTMCell_7/mul_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/Linear/MatMul"
  op: "MatMul"
  input: "RNN/BasicLSTMCell_8/Linear/concat"
  input: "RNN/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/add"
  op: "Add"
  input: "RNN/BasicLSTMCell_8/Linear/MatMul"
  input: "RNN/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/split"
  op: "Split"
  input: "RNN/BasicLSTMCell_8/split/split_dim"
  input: "RNN/BasicLSTMCell_8/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/add_1"
  op: "Add"
  input: "RNN/BasicLSTMCell_8/split:2"
  input: "RNN/BasicLSTMCell_8/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/Sigmoid"
  op: "Sigmoid"
  input: "RNN/BasicLSTMCell_8/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/mul"
  op: "Mul"
  input: "RNN/BasicLSTMCell_7/add_2"
  input: "RNN/BasicLSTMCell_8/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/BasicLSTMCell_8/Sigmoid_1"
  op: "Sigmoid"
